float [] HLE = {-1042, -3479.7, 1003.7, -1669, -1639.6, -14219, -3655.1, -4917, 9363.2, -4271.8, -24, 681};//東西方向
float [] HLN = {-17090, -13711, -22888, -19631, -23818, -18573, -19636, -15648, -18256, -15721, -17776, -15581};//南北方向
int N=12;//HLE陣列中值的數量
void setup()
{
  size(500,500);
  frameRate(10);//放慢晃動的速度
}
void draw()
{
  background(#FFFFF2);
  //             從無到有走了幾格 /100把HLE的值做縮小
  float dx = HLE[frameCount%N]/100;//有dx的移動量
  float dy = HLN[frameCount%N]/100;//dy的移動量
  rect(200+dx,200+dy,100,100);//正方形
}
